# 틀(class)
class Day:
    # 속성 --> 필드, 프로퍼티 --> 변수
    # 동작 --> 메서드 --> 함수

    # __init__을 만들어줬으면
    # 변수선언을 생략할 수 있음.
    # 인스턴스 생성할 때 
    # 인스턴스마다 힙영역에 복사되는
    # 변수는 인스턴스 변수라고 한다.
    doing = None; # ""
    time = 0;
    location = None;
    
    # 클래스에 하나만 있어서
    # 인스턴스를 만들어도 힙영역에 복사되지 않음.
    # 클래스 변수, 정적 변수
    count = 0;

    # 인스턴스 생성할 때마다
    # 자동으로 호출하여 필드의 초기화를 보통 담당.
    def __init__(self, doing, time, location):
        self.doing = doing;
        self.time = time;
        self.location = location;
        Day.count = Day.count + 1;
        # self : 이 클래스로 만들어진 인스턴스 그 자신!!
        # 여기에서 접근하는 변수는 힙영역의 인스턴스가 가르키는 변수임.
        # print(self.doing)

    # 인스턴스를 프린트할 때 
    # 프린트할 문자열을 만들어서 리턴해주는 함수
    # object클래스로부터 상속받았음
    # --> 함수 재정의
    def __str__(self):
        print("진짜 내가 호출됨.!! 안녕 😎")
        return self.doing + " " + str(self.time) + " " + self.location;

    def study(self):
        print("공부하다.")

# 틀을 가지고 찍어내서 그 물건을 써야한다.
# 클래스의 instance, 실제로 사용할 대상 object
# day1 = Day();
# 기호는 연산자(cpu가 뭔가 간단한 처리를 하는 것)
# .연산자 : 안으로 접근해서 들어가라는 의미, 접근 연산자
# day1.doing = "파이썬"
# day1.time = 9;
# day1.location = "금천구"

day1 = Day("파이썬", 9, "금천구");
# 인스턴스 생성할 때 초기값을 같이 넣어주자.!
# print(day1.doing)
# print(day1.time)
# print(day1.location)
print(day1); #샌프란, __str()__호출된 후 프린트
#day1애 들어있는 저장소가 가르키는 곳에 있는거 다 프린트
day1.study();
print(Day.count);

print("----------------------")
day2 = Day("자체휴강", 12, "영등포구");

# day2.doing = "자체휴강"
# day2.time = 12;
# day2.location = "영등포구"

# print(day2.doing)
# print(day2.time)
# print(day2.location)

day2.study();
print(day2);

print(Day.count);

